src/CFD/OpenFOAM/OpenFOAM-v2206-MUI/modules/OpenQBMM/tutorials/compressiblePbeTransportFoam/forwardStep/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     compressiblePbeTransportFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.025;

deltaT          1e-5;

writeControl    adjustableRunTime;

writeInterval   1e-4;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  true;

maxCo   0.5;

functions
{
    libs            ("libfieldFunctionObjects.so");

    Ma
    {
        type            MachNo;
        executeControl  writeTime;
        writeControl    writeTime;
    }
}


// ************************************************************************* //
